{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.7.2", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_8", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_8", "trainable": true, "batch_input_shape": [1, null], "dtype": "float32", "input_dim": 94, "output_dim": 512, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "LSTM", "config": {"name": "lstm_6", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "time_major": false, "units": 1024, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "LSTM", "config": {"name": "lstm_7", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "time_major": false, "units": 1024, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 94, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": {}, "metrics": [], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "RMSprop", "config": {"name": "RMSprop", "learning_rate": 0.001, "decay": 0.0, "rho": 0.9, "momentum": 0.0, "epsilon": 1e-07, "centered": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of15.bin", "group1-shard2of15.bin", "group1-shard3of15.bin", "group1-shard4of15.bin", "group1-shard5of15.bin", "group1-shard6of15.bin", "group1-shard7of15.bin", "group1-shard8of15.bin", "group1-shard9of15.bin", "group1-shard10of15.bin", "group1-shard11of15.bin", "group1-shard12of15.bin", "group1-shard13of15.bin", "group1-shard14of15.bin", "group1-shard15of15.bin"], "weights": [{"name": "dense_8/kernel", "shape": [1024, 94], "dtype": "float32"}, {"name": "dense_8/bias", "shape": [94], "dtype": "float32"}, {"name": "embedding_8/embeddings", "shape": [94, 512], "dtype": "float32"}, {"name": "lstm_6/kernel", "shape": [512, 4096], "dtype": "float32"}, {"name": "lstm_6/recurrent_kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "lstm_6/bias", "shape": [4096], "dtype": "float32"}, {"name": "lstm_7/kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "lstm_7/recurrent_kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "lstm_7/bias", "shape": [4096], "dtype": "float32"}]}]}